openwch/ch55x/10,CH558CH559 smulate HID compatible and keyboard composite devices/Compound.C
/********************************** (C) COPYRIGHT ******************************
* File Name          :Compound_Dev.C												
* Author             : WCH                                                      
* Version            : V1.2                                                     
* Date               : 2017/02/24                                               
* Description        : A demo for USB compound device created by CH559, support 
					   keyboard , and HID-compliant device.                     
********************************************************************************/

#include 	"CH559.H"
#include 	"DEBUG.H"
#include 	"compound.h"
#include 	<stdio.h>
#include 	<stdlib.h>
#include 	<string.h>


#define 	THIS_ENDP0_SIZE         DEFAULT_ENDP0_SIZE
#define		BUFFER_SIZE				64
#define 	DUAL_BUFFER_SIZE		128
#define 	UsbSetupBuf     		((PUSB_SETUP_REQ)Ep0Buffer)
#define		L_WIN 					0X08
#define 	L_ALT 					0X04
#define		L_SHIFT					0X02
#define 	L_CTL					0X01
#define 	R_WIN 					0X80
#define 	R_ALT 					0X40
#define 	R_SHIFT					0X20
#define 	R_CTL					0X10
#define 	SPACE					0X2C
#define		ENTER					0X28

#define MOUSE 0

#pragma  NOAREGS

UINT8X  	Ep0Buffer[THIS_ENDP0_SIZE]  _at_ 0x0000;  								// Endpoint 0, buffer OUT/OUT£¬the address must be even.
UINT8X  	Ep1Buffer[BUFFER_SIZE] 		_at_ 0x000A;  								// Endpoint 1, buffer IN£¬the address must be even.
UINT8X 		Ep2Buffer[DUAL_BUFFER_SIZE]	_at_ 0x0050;  								// Endpoint 2, buffer OUT[64]+IN[64]£¬the address must be even.


/**************************** Global variable ********************************/	
UINT8   volatile	SetupReq, SetupLen, UsbConfig;
UINT8	volatile	EnumOK, FLAG;
PUINT8  	pDescr;                                                                	// USB enumerate complete flag.
USB_SETUP_REQ   					SetupReqBuf;                                   	// A buffer for Setup package.

char code sPath[] = "`  C:\\HID_RECV.EXE   \r   ";										// The path for the software. SPACE for delay
char *pStr = sPath;

UINT8 HIDCom[64] = {0};												
UINT8 HIDKey[8] = {0};

/**************************** Device Descriptor *************************************/
UINT8C DevDesc[18] = {																// Device Descriptor
	0x12,0x01,
	0x10,0x01,
	0x00,0x00,
	0x00,0x08,                      
	0x31,0x51,																		// Vendor ID   |  VID =  0X5131///413c
	0x07,0x20,																		// Product ID  |  PID = 0X2007 /// 2105
//	0x00,0x01,
//	0x05,0x21,
	0x00,0x11,																		// bcdDevice		
	0x00,0x00,
	0x00,0x01
};
/**************************** HID Report Descriptor *********************************/
UINT8C KeyRepDesc[65] = 															// Report Descriptor, DELL Keyboard
{
	0x05, 0x01, 		// Usage page Generatic Desktop
	0x09, 0x06, 		// Usage keyboard
	0xa1, 0x01, 		// Collation Application
	0x05, 0x07, 		// Usafe page (key code)
	0x19, 0xe0, 		// Usage Min ( E0 -->  L_CTL)
	0x29, 0xe7, 		// Usage MAX ( E7 --> R_GUI )
	0x15, 0x00, 		// Logical min
	0x25, 0x01, 		// Logical max
	0x95, 0x08, 		// Report count ( 8 )
	0x75, 0x01, 		// Report size	( 1 )
	0x81, 0x02, 		// Input ( Data, Variable, Absolute )
	0x95, 0x08, 		// Report count ( 8 )
	0x75, 0x01, 		// Report size	( 1 )
	0x81, 0x01, 		// Input ( const )
	0x05, 0x08, 		// Usage page( LED )
	0x19, 0x01, 		// Usage min ( 1 )
	0x29, 0x03, 		// Usage max ( 3 )
	0x95, 0x03, 		// Report count ( 3 )
	0x75, 0x01, 		// Report size ( 1 )
	0x91, 0x02, 		// Output ( Data, Variable, Absolute )
	0x95, 0x01, 		// Report count ( 1 )
	0x75, 0x05, 		// Report size ( 5 )
	0x91, 0x01, 		// Output ( const )
	0x05, 0x07, 		// Usage page ( key code )
	0x19, 0x00, 		// Usage min ( 0H )
	0x2a, 0xff, 0x00,	// Usage max ( FFH )
	0x15, 0x00,			// Logical min ( 0H )
	0x26, 0xff, 0x00,	// Logical max ( FFH )
	0x95, 0x06, 		// Report count ( 6 )
	0x75, 0x08, 		// Report size ( 8 )
	0x81, 0x00, 		// Input ( Data, Array, Absolute )
	0xc0				// End collection
};

UINT8C ComRepDesc[34] = 															// Report Descriptor, Composite device
{
	0x06, 0x00, 0xff, 	// Usage page Vendor defined
	0x09, 0x01, 		// Usage keyboard
	0xa1, 0x01, 		// Collation Application
	0x09, 0x02, 		// Mouse
	0x15, 0x00, 		// Logical min ( 0H )
	0x26, 0x00, 0xff,	// Logical max ( FFH )
	0x75, 0x08,  		// Report size ( 08H )
	0x95, 0x40, 		// Report count ( 40H )
	0x81, 0x06,  		// Input ( Data, Relative, Wrap )
	0x09, 0x02, 		// Mouse
	0x15, 0x00,  		// Logical min ( 0H )
	0x26, 0x00, 0xff,	// Logical max ( FFH )
	0x75, 0x08, 		// Report size ( 08H )
	0x95, 0x40, 		// Report count ( 40H )
	0x91, 0x06, 		// Output ( Data, Relative, Wrap )
	0xc0,
};


UINT8C CfgDesc[9+9+9+7+9+9+7+7] =
{
    0x09,0x02,0x42,0x00,0x02,0x01,0x00,0xA0,0x32,             						// Configure Descriptor
	     
//	0x09,0x02,0x22,0x00,0x01,0x01,0x00,0xA0,0x32,
	0x09,0x04,0x00,0x00,0x01,0x03,0x01,0x01,0x00,             						// Interface Descriptor, keyboard
    0x09,0x21,0x11,0x01,0x00,0x01,0x22,sizeof(KeyRepDesc),0x00,             		// HID Descriptor
    0x07,0x05,0x81,0x03,0x08,0x00,0x0a,                       						// Endpoint Descriptor, 50ms

//   0x09,0x02,0x29,0x00,0x01,0x01,0x00,0xA0,0x32,             						// Configure Descriptor	
//    0x09,0x04,0x00,0x00,0x02,0x03,0x00,0x00,0x00,             						// Interface Descriptor, Composite device£¬ 2 EPs
	0x09,0x04,0x01,0x00,0x02,0x03,0x00,0x00,0x00,             						// Interface Descriptor, Composite device£¬ 2 EPs
    0x09,0x21,0x10,0x01,0x21,0x01,0X22,sizeof(ComRepDesc),0x00,             		// HID Descriptor
    0x07,0x05,0x82,0x03,0x40,0x00,0x32,                        						// Endpoint Descriptor, 10ms, IN
	0x07,0x05,0x02,0x03,0x40,0x00,0x0a												// Endpoint Descriptor,	10ms, OUT
};


/*******************************************************************************
* Function Name  : USBDeviceCfg()
* Description    : Configure USB mode
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
extern void USBDeviceCfg( void )
{
    USB_CTRL = 0x00;                                                           			// Clear USB_CTRL register
    USB_CTRL &= ~bUC_HOST_MODE;                                                			// Device mode
    USB_CTRL |=  bUC_DEV_PU_EN | bUC_INT_BUSY | bUC_DMA_EN;                    			// Enable inter PULL_UP. Auto return NAK, during interrupt routing, if the interrupt flag.
    USB_DEV_AD = 0x00;                                                         			// Initial the device address
    UDEV_CTRL &= ~bUD_RECV_DIS;                                                			// Enable receiver register
	
    USB_CTRL &= ~bUC_LOW_SPEED;			
    UDEV_CTRL &= ~bUD_LOW_SPEED;                                             			// Default mode, FULL SPEED 12Mbps.
    UDEV_CTRL |= bUD_DP_PD_DIS | bUD_DM_PD_DIS;                                			// Disable DM/PM PULL_DOWN.
    UDEV_CTRL |= bUD_PORT_EN;                                                  			// Enable USB port.
}
/*******************************************************************************
* Function Name  : USBDeviceIntCfg()
* Description    : USB device init configure.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
extern void USBDeviceIntCfg( void )
{
    USB_INT_EN |= bUIE_SUSPEND;                                               			// Enable USB device suspend interrupt.
    USB_INT_EN |= bUIE_TRANSFER;                                              			// Enable USB transmissions interrupt.
    USB_INT_EN |= bUIE_BUS_RST;                                               			// Enable USB BUS RST interrupt.
    USB_INT_FG |= 0x1F;                                                       			// Clear interrupt flag.
    IE_USB = 1;                                                               			// Enable USB interrupt
    EA = 1;                                                                   			// Enable MCU interrupt
}
/*******************************************************************************
* Function Name  : USBDeviceEndPointCfg()
* Description    : Configure tie Endpoint, compound device, 
				   Endpoint 0 control trans, Endpoint 1/2 interrupt(IN).
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
extern void USBDeviceEndPointCfg( void )
{
    UEP1_DMA = Ep1Buffer;                                                      			// Endpoint 1 uploard address
    UEP4_1_MOD |= bUEP1_TX_EN;                                                 			// Endpoint 1 send enable
    UEP4_1_MOD &= ~bUEP1_RX_EN;                                                			// Endpoint 1 receive disable
    UEP4_1_MOD &= ~bUEP1_BUF_MOD;                                              			// Endpoint 1 sigle 64 byte send buffer
    UEP1_CTRL = bUEP_AUTO_TOG | UEP_T_RES_NAK;                                 			// Endpoint 1 auto Toggle flag, In translation return NAK
    
