openwch/ch55x/10,CH558CH559 smulate HID compatible and keyboard composite devices/Compound.C
/*******************************************************************************
* Function Name  : static SendKey( char *p)
* Description    : ASCII to key code
* Input          : char *p
* Output         : None
* Return         : None
*******************************************************************************/

static void SendKey ( char *p )
{

	char c = *p;
		
	if( (c >= 'a') && (c <= 'z' )){
		c = c - 'a' + 'A';
	}
	
	if( (c >= 'A') && (c <= 'Z' )){
		HIDKey[2] = c - 'A' + 4;
	}
	else
		if( c >= '1' && c <= '9' )
			HIDKey[2] = c - '1' + 0X1E;
		else
		{
		switch ( c ){
			case '`' :
				HIDKey[0] = 0X08;
				HIDKey[2] = 0X15;
				break;
			case '\\':
				HIDKey[2] = 0x31;
				break;
			case ' ':
				HIDKey[2] = L_SHIFT;
				break;
			case '\r':
				HIDKey[2] = ENTER;
				break;
			case ':':
				HIDKey[0] = 0x02;
				HIDKey[2] = 0x33;
				break;
			case '+':
				HIDKey[0] = 0x000;
				HIDKey[2] = 0x57;
				break;
			case '_':
				HIDKey[0] = 0X02;
				HIDKey[2] = 0X2D;
				break;
			case '/':
				HIDKey[0] = L_CTL + L_ALT;
				HIDKey[2] = 0X16;
				break;
			case '0':
				HIDKey[2] = 0X27;
				break;
			case '.':
				HIDKey[2] = 0X37;
				break;
			case '~':
				HIDKey[0] = L_ALT;
				HIDKey[2] = 0X05;
				break;
			case '!':
				HIDKey[0] = L_ALT;
				HIDKey[2] = 0X08;
				break;
			default:
				break;
		}
	}
	
	mDelaymS( 20 );																				//emulate the press down and pop up
	while(FLAG == 0);                                           								// Upload the key
	Enp1IntIn();						
	while(FLAG == 0);   																					
	mDelaymS( 20 );
	HIDKey[0] = 0X00;     						
	HIDKey[2] = 0X00;                                              								// Reset the key
	while(FLAG == 0);                                           						
	Enp1IntIn();			
	while(FLAG == 0); 
}

/*******************************************************************************
* Function Name  : static void UploadData(void)
* Description    : Upload the HID code
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
static void UploadData(void)
{
	UINT8 i;
	for( i = 1; i < 64 ;i ++ )
		HIDCom[i] += rand();
}
/*******************************************************************************
* Function Name  : extern HIDValueHandle( void )
* Description    : Upload the HID code
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
extern void HIDValueHandle( void )
{
	static UINT8 rotateFlag = 0;																// When upload keys complete, upload EP2 data
	UINT8 readFlag = 1;																			// Uploading the keys ok.
	if (rotateFlag)							
    {
		HIDCom[0] += 0x01;	
		UploadData();

		Enp2IntIn();	
	}			
	else
	{	
		if( readFlag == 1 )		
		{ 			
       		SendKey(pStr);																		// Upload path
			pStr++;	
			if(*pStr == '\0')			
			{
				readFlag = 0;	
				SendKey( "~" );																	// Upload ALT+B
				mDelaymS( 200 );	
				rotateFlag = 1;
			}		
		}
		else			
		{			
			UEP1_CTRL = UEP1_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_NAK;   						// Default return NAK
			UEP2_CTRL = UEP2_CTRL & ~ MASK_UEP_T_RES | UEP_T_RES_NAK;   			
		}	
	}	

}

/**************************** END *************************************/
